РУС/src/Documents/УстановкаТарифаНаУслугу/УстановкаТарифаНаУслугу.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>УстановкаТарифаНаУслугу</name>
  <registerRecords>InformationRegister.ЦеныНаУслуги</registerRecords>
  <attributes>
    <name>Услуга</name>
    <type>
      <types>CatalogRef.Услуги</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипГрузовыхМест</name>
    <type>
      <types>CatalogRef.ТипыГрузовызРазмещений</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Цены</name>
    <attributes>
      <name>КоличествоОт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоДо</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипДня</name>
      <type>
        <types>EnumRef.ТипыДней</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

РУС/src/InformationRegisters/ЦеныНаУслуги/ЦеныНаУслуги.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЦеныНаУслуги</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Услуга</name>
    <type>
      <types>CatalogRef.Услуги</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипГрузовогоМеста</name>
    <type>
      <types>CatalogRef.ТипыГрузовызРазмещений</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КоличествоОт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>КоличествоДо</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипДня</name>
    <type>
      <types>EnumRef.ТипыДней</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

РУС/src/Documents/УстановкаТарифаНаУслугу/ObjectModule.bsl
//@skip-check module-structure-method-in-regions
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	НаборЗаписей = РегистрыСведений.ЦеныНаУслуги.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Регистратор.Установить(Ссылка);
	НаборЗаписей.Прочитать();
	НаборЗаписей.Очистить();
	
	Для каждого Строка из Цены цикл
		нСтр = НаборЗаписей.Добавить();
		нСтр.Регистратор 		= Ссылка;
		нСтр.Услуга 			= Услуга;
		нСтр.ТипГрузовогоМеста 	= ТипГрузовыхМест;
		нСтр.КоличествоОт 		= Строка.КоличествоОт;
		нСтр.КоличествоДо 		= Строка.КоличествоДо;
		нСтр.ТипДня 			= Строка.ТипДня;
		нСтр.Цена 				= Строка.Цена;
		нСтр.Период				= Дата;
	КонецЦикла;
	НаборЗаписей.Записать();
КонецПроцедуры
